# kr1_sum_calc_task_2_1.py
# Завдання 2.1 КР
# функція приймає на вхід список цілих чисел,
# за допомогою циклу та умовного оператора 
# повертає суму тільки парних додатних чисел із цього списку 

def sum_calc(numbers: list) -> int:
    # початкова сума
    sum = 0

    for number in numbers:
        # перевірка чи є число одночсно і додатним, і парним 
        if number > 0 and number % 2 == 0:
            print(f"Знайдено парне додатнє число: {number}")
            sum = sum + number
    # накопичена сума
    return sum

mixed_list = [1, 2, 3, 5, -6, -7, 8, 0, 11, 12, -13]
res = sum_calc(mixed_list)

#очікуваний результат - список з чисел 2, 6, 12 загальною сумою 22
print(f"Був заданий список чисел: {mixed_list}")
print(f"Загальна сума парних додатних чисел у заданому списку: {res}") 

