# kr1_sets_on_lists_task_3_3_2.py
# Завдання 3.3.2. Спільні та унікальні елементи списків за допомогою множин
print("\n * Завдання 3.3.2. Спільні та унікальні елементи списків A і B за допомогою множин *")
print()


list_A = [1, 3, 3, 3, 5, 7, 11, 13] #дублікат 3
list_B = [5, 7, 11, 13, 17, 17, 17] #дублікат 17

print(f"список A: {list_A}")
print(f"список B: {list_B}")

# перетворення списків на множини  (=автоматичне видалення дублікатів)
set_A = set(list_A)
set_B = set(list_B)

print("\nперетворення списків на множини = автоматичне видалення дублікатів:")
print(f"множина A: {set_A}")
print(f"множина B: {set_B}")

# Тест 3.3.2.1
# 1) елементи, які є в обох списках (перетин A & B)
common_elements = set_A & set_B
print("\n1)перетин A & B (елементи, які є в обох списках): ")
print(f"(set_A & set_B): {common_elements}")

# Тест 3.3.2.2
# 2) елементи, які є тільки в одному зі списків (симетрична різниця A ^ B))
# Це операція Симетричної різниці (Symmetric Difference): A ^ B
unique_to_one = set_A ^ set_B
print("\n2)симетрична різниця (елементи, що є тільки в одному зі списків)")
print(f"(set_A ^ set_B): {unique_to_one}")
