# kr_1_recursion_hanoi_tower_task_7_3.py
# Завдання 7.3 3. Реалізуйте одну рекурсивну функцію на вибір.
# обрана задача Ханойська вежа

def hanoi_tower(n, source, dest, aux):
    #Базовий випадок: зупинка рекурсії
    if n == 1:
        print(f"Перемістити диск 1 з {source} на {dest}")
        return
    
    #Рекурсивний крок1: перемістити N-1 дисків на допоміжний стрижень
    hanoi_tower(n - 1, source, aux, dest)
    
    #Центральний крок: перемістити найбільший диск (N)
    print(f"Перемістити диск {n} з {source} на {dest}")
    
    #Рекурсивний крок2: Перемістити N-1 дисків на кінцевий стрижень
    hanoi_tower(n - 1, aux, dest, source)

#Тестування-------------------
N_DISKS = 3
print(f"\n*** ТЕСТУВАННЯ: Ханойська Вежа (N={N_DISKS}) ***")
print(f"* Очікувана кількість кроків: {2**N_DISKS - 1} *")
hanoi_tower(N_DISKS, 'A', 'C', 'B')